/************************     הוראות חשובות      ***********************/

/**
 
 1.   במידה וזאת פעם ראשונה שלכם ממלאים תוכן בלומדה, קראו את **קובץ הוורד** המצורף בתקייה
 2.   בעמוד זה יש למלא את הפרטים לגבי כל המידע והתוכן המבוקש
 3.   [amountOfQuestions במשתנה] לשים לב שבכל נושא צריך לכתוב את *כמות השאלות המקסימלית* שתלקח ממנו
      **משתנה זה מתייחס רק לשאלות שיילקחו בשביל **המבחן
 */


/************************      הכנס כותרת ראשית שהיא שם הלומדה      ***********************/
const TITLE = "מידע לחייל הדתי";

/************************      הכנס כמות זמן התחלתית של המבחן      ***********************/
const TIME_FOR_EXAM = "7:00";

// אובייקט המכיל את כל המידע של הלומדה הכולל את התוכן, השאלות לכל נושא וכמות השאלות שיילקח מכל נושא למבחן
const DATA = { 
    // שם נושא
    "פקודות דת לחייל": {
        "icon":  "../assets/images/learning/מסכים/assets/AhraiKashrut.png", // הכנס קישור של אייקון
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: "חייל זכאי להתפלל דווקא במניין",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "רק אם יש זמן ללכת לבית כנסת",
                ans4: "רק אם המפקד מאשר",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "חייל שאינו מתפלל בקביעות זכאי לומר קדיש על הוריו במניין",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "נכון, ואפילו יכול לעבור לבסיס שיש בו מניין בעבור זה",
                ans4: "רק אם המפקד מאשר",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "חייב להתפלל שלוש תפילות ביום כדי להיות זכאי להתפלל במניין",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "לפחות תפילת שחרית",
                ans4: "רק אם מתפלל גם בשבת",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "חיילים שיש להם מניין זכאים להתפלל דווקא בבית הכנסת ולא במקום אחר",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "אפשר גם בכיתה",
                ans4: "נתון לשקול דעתו של המפקד",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "מותר לקיים מד\"ס לפני התפילה מיד כשמתעוררים",
                ans1: "כן",
                ans2: "לא",
                ans3: "כן, אם אין זמן אחר",
                ans4: "רק מהחיילים שלא שומרים שבת",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "מותר למפקד לדרוש מחייליו להתפלל שחרית לאחר הארוחה",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "רק אם אין זמן אחר",
                ans4: "רק מי ששומר שבת פטור",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "האם מותר למפקד להיפגש עם חייליו ל-ח' בוקר לפני התפילה",
                ans1: "כן",
                ans2: "לא",
                ans3: "מי שמתפלל פטור",
                ans4: "רק ביום חול",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "באיזה ימים בשבוע זמן התפילה הוא 40 דקות",
                ans1: "כל ימי השבוע",
                ans2: "א, ג, ד, ו",
                ans3: "ב, ה",
                ans4: "שבת",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "בשבת זמן התפילה הוא מקסימום שעתיים",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "תלוי אם יש זמן בלו\"ז",
                ans4: "שעה וחצי ולבקש הארכה מהמפקד",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "ניתן לקצר את זמן התפילה במידת הצורך",
                ans1: "אם החיילים הפריעו מותר",
                ans2: "מ\"פ יכול לקצר זמן תפילה מטכ\"לי",
                ans3: "נכון",
                ans4: "לא נכון",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "חייל שאינו שומר שבת לא זכאי לנוהל שבת שעתיים לפני כניסתה",
                ans1: "לא נכון",
                ans2: "נכון",
                ans3: "רק מי שמתפלל זכאי",
                ans4: "רק מי שהמפקד יודע זכאי",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "מותר לדרוש מחייל לצאת מהבית לבסיס בטרם עברה שעה מצאת השבת",
                ans1: "רק אם הוא גר רחוק",
                ans2: "רק אם הוא גר קרוב",
                ans3: "לא נכון",
                ans4: "נכון",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "מותר להסריט את הקידוש בפלאפון בערב שבת",
                ans1: "אם אין חיילים דתיים מותר",
                ans2: "נכון",
                ans3: "לא נכון",
                ans4: "רק למפקדים מותר",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "לארוחות שבת מגיעים על מדים מלאים",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "אפשר להגיע גם על אזרחי",
                ans4: "אפשר להגיע על מד\"ס",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "לארוחת ערב שבת מגיעים על מדי א'",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "רק מי שדתי",
                ans4: "מי שרוצה יכול להגיע על ב",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "רק חייל דתי זכאי לצום בצומות",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "אם הוא מתפלל כן",
                ans4: "רק באישור הרב",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "חייל בצום חייב להיות נוכח ביום הישיבה שיתקיים בבית הכנסת במהלך הצום למעט בשחרור מפקד/רב קריית ההדרכה",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "מי שרוצה",
                ans4: "רק טירונים",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "מותר לקבוע לחיילים מד\"ס מיד בצאת הצום",
                ans1: "נכון",
                ans2: "לא נכון, חייל פטור מפעילות עצימה במשך 6 שעות",
                ans3: "אם הצום יוצא מאוחר ואין זמן אחר אז אפשר",
                ans4: "אפשר לעשות אחרי שעתיים אם כולם מסכימים",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "ניתן לקבוע ארוחות בהפרש של פחות משש שעות בין בשר לחלב במידה ואין תיאום אחר לחדר האוכל",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "לחיילים שאינם מתפללים אפשר",
                ans4: "אי אפשר רק אם ישנם חיילים דתיים בצוות",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "מותר להוציא אוכל מחדר האוכל לחייל חולה בכלים רב פעמיים",
                ans1: "נכון",
                ans2: "באישור המגיש",
                ans3: "לא נכון",
                ans4: "רק אם אין כלים חד\"פ",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "מותר להכין נס קפה בחדר האוכל",
                ans1: "לא נכון",
                ans2: "באישור מפקד",
                ans3: "נכון",
                ans4: "אם המשגיח כשרות מאשר",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "מותר לאכול ללא מגש אם אני לא מלכלך את השולחן",
                ans1: "לא נכון",
                ans2: "נכון",
                ans3: "רק אם זה לא נוח",
                ans4: "באישור מפקד",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "לחייל דתי מותר להכניס אוכל כשר לחדר האוכל",
                ans1: "כלים אישיים של החייל אפשר",
                ans2: "לא נכון",
                ans3: "בכלים חד פעמיים אפשר",
                ans4: "נכון",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "ניתן ללכת ליום ישיבה בישיבה שלי",
                ans1: "נכון",
                ans2: "באישור מפקד",
                ans3: "באישור ראש הישיבה",
                ans4: "לא נכון",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "חייל שלא קיבל ימי ישיבה במשך חודשיים זכאי לשלושה ימי ישיבה בחודש השלישי",
                ans1: "לא נכון",
                ans2: "לא. בעיה שלו שהוא לא קיבל כבר חודשיים",
                ans3: "נכון",
                ans4: "לפי החלטת המפקד",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "חייל בטירונות/קורס לא זכאי ליום ישיבה",
                ans1: "לא נכון",
                ans2: "נכון",
                ans3: "רק ג'ובניקים",
                ans4: "תלוי איזה קורס/טירונות",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "רק לחיילת שקיבלה אישור לכך מותר לנוע עם חצאית",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "אם היא דתייה לא צריך אישור",
                ans4: "אין צורך באישור כדי לנוע עם חצאית",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "אסור להוציא ציציות מחוץ למכנסיים",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "צריך אישור לכך",
                ans4: "רק חייל דתי מותר",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "אסור לשים כיפה גדולה ובולטת מדי",
                ans1: "לא נכון",
                ans2: "נכון",
                ans3: "רק חייל דתי יכול",
                ans4: "צריך אישור מפקד",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "לא ניתן להמשיך תהליך גיור במהלך קורס",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "באישור מפקד",
                ans4: "תלוי איזה קורס/טירונות",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "בכדי לקדם תהליך גיור חייב להגיע לכיתת גיור פעם בחודש ולשני שיעורים שבועיים",
                ans1: "נכון",
                ans2: "לפי הזמן הפנוי שיש לי",
                ans3: "רק אם אני רוצה",
                ans4: "לא נכון",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "מותר לחייל להיכנס למגורי חיילות, ולהפך",
                ans1: "נכון",
                ans2: "אם המגורים ריקים אפשר",
                ans3: "לא נכון",
                ans4: "רק אם מסכימים לו/לה",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "למפקד מותר להיכנס למגורי בנות ללא התראה מוקדמת, וכן להפך",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "רק במידה וקיים צורך פיקודי מיידי",
                ans4: "צריך לוודא במפגש הראשון לפני שכולם מסכימים",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "יש הגבלות לבוש גם בזמן מד\"ס",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "רק בשטח פתוח",
                ans4: "לבנות כן, לבנים לא",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "חיילת זכאית להדרכת מד\"ס מחיילת ולא מגבר במידה וזה נוגד את מצפונה הדתי, וכן להפך",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "רק אם יש מדריכה זמינה",
                ans4: "נתון להחלטת מפקד",
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: "ניתן לחייב חייל/ת לצאת לפעילות פנאי שאינה מגדרית",
                ans1: "נכון",
                ans2: "נתון להחלטת מפקד",
                ans3: "לא נכון",
                ans4: "אם אי אפשר לארגן פעילות מגדרית אפשר לחייב",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "חייל/ת זכאים לפעילות מגדרית בתור תחליף לפעילות פנאי משותפת",
                ans1: "לא נכון",
                ans2: "רק באישור מפקד",
                ans3: "חייל שלא ישתתף בפעילות פנאי יבצע תורנויות",
                ans4: "נכון",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "ניתן לחייב חייל בעל פטור זמני בתוקף להתגלח",
                ans1: "נכון",
                ans2: "רק במוכנת גילוח כשרה",
                ans3: "רק אם הוא לא מתפלל",
                ans4: "לא נכון",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "לא ניתן לערער על בקשת פטור זקן שלא אושרה",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "רק באישור מפקד",
                ans4: "רק בטירונות",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "יתן לחייב חייל להתגלח עם סכין ולא עם מכונה כשרה",
                ans1: "נכון",
                ans2: "נתון לחלטת הרס\"ר",
                ans3: "לא נכון",
                ans4: "אפשר לחייב חייל שאינו דתי",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "חייל באבל זכאי לגדל זקן",
                ans1: "לא נכון",
                ans2: "רק חייל דתי",
                ans3: "נכון, באישור זמני מיוחד",
                ans4: "נתון להחלטת מפקד",
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: "בימי ספירת העומר ובימי בין המצרים גם חייל ללא פטור זקן ראשי להגיש בקשה לתקופות הנ\"ל",
                ans1: "נכון",
                ans2: "לא נכון",
                ans3: "רק חייל דתי",
                ans4: "המפקד מחליט מי יכול להגיש ומי לא",
                correctAns: "ans1"
            },
        ],
        "amountOfQuestions": 2,
        "learningContent": {
            "תפילה": {
                "תפילה במניין וקדיש יתום": [ 
                    {
                        cardType: "picAndText",
                        pic: "../assets/images/learning/מסכים/assets/TohenPic/TfilaTohen.png",
                        content: "כל חייל זכאי להתפלל במניין שלוש תפילות במהלך היום: שחרית, מנחה וערבית"
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: "חייל המעוניין להתפלל במניין תפילה אחת/שתיים ביום רשאי לעשות כך ובלבד שהדבר ייעשה באופן קבוע מידי יום",
                        text2:"ככלל, זכאי חייל להתפלל במניין בבית הכנסת בזמנים בהם מתקיימים מניינים לצורך אמירת קדיש ותפילה בשנת האבל ובכל שנה בשבוע האזכרה"
                    },
                        ],
                "איסור עשיית מלאכה קודם התפילה": [
                    {
                        cardType: "textTwoParagraphs",
                        text1: "פעולות אסורות לפני התפילה:\nריצת בוקר, גלח\"צ (אפשר לעשות בלילה לפני במקום בבוקר), נקיונות ,מסדרים וארוחת בוקר ",
                        text2:"ע\"פ הפקודה, אין לבצע שום עבודות קודם התפילה למעט סידור מיטה ראשוני ופריקת נשקים (ח' בוקר)"
                    }
                ],
                'לו\"ז תפילות בבתי הכנסת בקריית ההדרכה': [
                    {
                        cardType: "_3titles_3text",
                        subTitle1: "שחרית",
                        content1: "06:15 ,07:10",
                        subTitle2: "מנחה",
                        content2: "חורף: 12:35, 13:35 <br>קיץ: 13:35, 16:35",
                        subTitle3: "ערבית",
                        content3: "חורף: 18:30, 20:30 <br>קיץ: 20:30, 21:30",
                    }
                ],
                'זמני תפילה מטכלים בקריית ההדרכה': [
                    {
                        cardType: "pic_4titles_4text",
                        pic: "../assets/images/learning/מסכים/assets/TohenPic/ZmanTfilotTohen.png",
                        subTitle1: "שחרית",
                        content1: "בימים א, ג, ד, ו - 40 דקות <br> בימים ב, ה - 50 דקות ",
                        subTitle2: "מנחה",
                        content2: "20 דקות",
                        subTitle3: "ערבית",
                        content3: " 20 דקות",
                        subTitle4: "אחר",
                        content4: "חול המועד - שעה וחצי <br> פורים - שעתיים <br> ראש חודש, חנוכה וימי צום -<br> 60 דקות",
                    }
                ],

            },
            "שבת": {
                "נוהל שבת ולו\"ז השבת": [
                    {
                        cardType: "picAndText",
                        pic: "../assets/images/learning/מסכים/assets/TohenPic/ShabatTohen.png",
                        content: "אין להגדיר לחייל לו\"ז בשבת מלבד זמני הארוחות ופעילויות רשות"
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: "נוהל שבת - שעתיים לפי כניסת השבת כפי המפורסם בלו\"ז השבת",
                        text2: "בצאת השבת יינתנו לכלל החיילים לפחות 30 דקות לצורך התארגנות. רק לאחר 30 דקות אלו ניתן להגדיר לחייל זמנים להמשך לו\"ז"
                    },
                    {
                        cardType: "textThreeParagraphs",
                        text1: "חייל היוצא לביתו ביום שישי יבדוק שיגיע לביתו עד שעתיים לפני השבת ",
                        text2: "חיילים הגרים במקומות מרוחקים, או במקומות בהם אין תחבורה ציבורית צריכים לעדכן את המפקדים על כך על מנת להתאים את שעת היציאה להגעה הביתה",
                        text3: "חזרת החיילים לבסיס תהיה כך שיצאו מביתם לכל הפחות כשעה לאחר צאת השבת",
                    },
                ],
                "חדר אוכל": [
                    {
                        cardType: "listDots3",
                        numList: "6",
                        li1: "בחדר האוכל אין להפעיל רדיו וטלויזיה",
                        li2: "בשעת הקידוש אין להשתמש בפלאפונים - הנחיית מפקד קריית ההדרכה",
                        li3: "אין להפעיל מכשירים סלולרים",
                        li4: "מהלך הארוחות החיילים יהיו במדים מלאים",
                        li5: "בערב שבת החיילים יהיו על מדי א'",
                        li6: "ארוחות ליל שבת/חג תהיינה חגיגיות ולפני הארוחות יערך קידוש לכלל החיילים",
                        
                    }
                ],
                "מהלך השבת": [
                    {
                        cardType: "listDots3",
                        numList: "3",
                        li1: "אין להגדיר פעולות בשבת מלבד פעולות מבצעית ",
                        li2: "בכל שבת מגיע לקריית ההדרכה רב אורח שמעביר את כל הנדרש בשבת ויערוך עונג שבת לאחר סעודת ליל שבת",
                        li3: "כלל התפילות והשיעורים יתקיימו בבית הכנסת המרכז",
                        
                    }
                ],
                "מבחנים": [
                    {
                        cardType: "text",
                        content: "יש להקצות לחייל מספיק זמן ללימוד למבחנים לפני תחילת נוהל שבת כך שלא יצטרך ללמוד בשבת"
                  
                    }
                ]
            },
            "צומות": {
                "הנחיות לצום": [
                    {
                        cardType: "picAndText",
                        pic:"../assets/images/learning/מסכים/assets/TohenPic/ChomotTohen.png" ,
                        content: "ימי הצום הם: צום גדליה, יוה\"כ, עשרה בטבת, תענית אסתר, יז' בתמוז, תשעה באב "
                    },
                    {
                        cardType: "listDots3",
                        numList: "3",
                        li1: "כל חייל המעוניין לצום זכאי לכך",
                        li2: "במהלך הצום יהיה החייל פטור מכל פעילות",
                        li3: "בחציו הראשון של יום הצום יתקיים יום ישיבה, ובו יוכל לעסוק בענייני הצום. בחציו השני של היום, לאחר סיום יום הישיבה, יוכל החייל לשהות בחדרו או בבית הכנסת עד צאת הצום. שחרור מלו\"ז באישור מפקד או רב קריית ההדרכה",
                    },
                    {
                        cardType: "listDots3",
                        numList: "3",
                        li1: "לפני כל צום יצאו הנחיות וזמני צום ע\"י רבנות קריית ההדרכה",
                        li2: "בערב הצום ובסיומו תינתן ארוחה חמה לחיילים הצמים (ולא פריסה)",
                        li3: "לאחר צאת הצום ותפילת ערבית חזרה לשגרה למעט פעילות עצימה למשך 6 שעות"
                    }
                ],
            },
            "כשרות": {
                "הפרדה בין ארוחות": [
                    {
                        cardType: "text",
                        content: "לפי הפקודות יש לשמור בחדר אוכל צבאי זמן של 6 שעות בין ארוחה בשרית לחלבית. החישוב ייעשה מסיום הארוחה הבשרית לתחילת הארוחה החלבית\n\nלדוגמא - אם חייל סיים לאכול ארוחת צהריים בשעה 13:30, ארוחת הערב לא תתחיל לפני השעה 19:30"
                    }
                ],
                "כשרות בחדר אוכל": [
                    {
                        cardType: "picAndText",
                        pic:"../assets/images/learning/מסכים/assets/TohenPic/KashrutTohen.png" ,
                        content: "כלים חלביים - יסומנו בצבע כחול או כיתוב חלבי. כוס חלבית תהיה בעלת ידית, סכו\"ם מחורר בקצהו <br> כלים בשריים – יסומנו בצבע אדום או כיתוב בשרי. כוס ללא ידית, סכו\"ם לא מחורר",
                    },
                    {
                        cardType: "listDots3",
                        numList: "3",
                        li1: "חייל המוצא כלים מחוץ לחדר האוכל או מוצא כלי שהתערבב עם כלים לא תואמים (בשרי עם חלבי) ימסור את הכלי למשגיח הכשרות",
                        li2: "אין להכניס כלים ומזון לתוך חדר האוכל (כולל אבקות נס קפה, מרק עוף וכו)'",
                        li3: "על פי הפקודה אין למזוג חלב בכוסות. ניתן למזוג חלב אך ורק בקערת דגנים שהדגנים נמצאים כבר בתוכה",
                    },
                    {
                        cardType: "listDots3",
                        numList: "5",
                        li1: "חובה לאכול עם מגש מאופיין בכל ארוחה",
                        li2: "האוכל בחדר האוכל כשר בהשגחת הרבנות הצבאית",
                        li3: " כל הבשר בחדר האוכל חלק בהשגחת הרבנות הראשית לישראל",
                        li4: "מנות מהדרין - ישנה אפשרות לקבל מנות בשריות מהדרין/גלאט ארוזות. חייל המעוניין בכך יבקש מעובד המטבח או ממשגיח כשרות",
                        li5: "ניתן למצוא משגיח כשרות צבאי ליד עמדת ההגשה של האוכל"
                    }
                ]
            },
            "ימי ישיבה ושיעורים": {
                "זכאות לימי ישיבה לחייל הדתי": [
                    {
                        cardType: "text",
                        content: "לפי הפקודות יש לאפשר לחייל דתי המעוניין בכך לצאת לימי ישיבה שמקיימת הרבנות הצבאית: שלושה ימי עיון בכל שלושה חודשים, אשר יוגדרו על ידי מפקד החייל בלבד\n\n בקריית ההדרכה מתקיים יום ישיבה אחת לחודש ללא צורך לצאת מהיחידה"
                    }
                ],
                "שיעורים קבועים בבסיס": [
                    {
                        cardType: "picAndText",
                        pic:"../assets/images/learning/מסכים/assets/TohenPic/YomYeshivaTohen.png" ,
                        content: "בכל יום מתקיימים שיעורי תורה לחיילים ולחיילות בבית הכנסת לפי לוח הזמנים המופיע בלוחות הרבנות. השתתפות באישור מפקד/ת"
                    }
                ]
            },
            "ציוד דת": {
                "חצאית": [
                    {
                        cardType: "picAndText",
                        pic:"../assets/images/learning/מסכים/assets/TohenPic/ChiudDatTohen.png" ,
                        content: "חיילת המבקשת חצאית א' או ב' – יש להעביר את בקשתה דרך המפקדים<br>בעת קבלת החצאית עליה להזכות על מכנסי א' ומכנסי ב' שברשותה <br>אורך החצאית כ-3 ס\"מ מתחת לברך"
                    }
                ],
                "ציצית וכיפה": [
                    {
                        cardType: "listDots3",
                        numList: "4",
                        li1: "כל חייל הרוצה ללבוש ציצית רשאי לכך",
                        li2: "חייל שמקפיד להוציא ציציות מחוץ למכנסיו רשאי לעשות כן",
                        li3: "כל חייל שרוצה לחבוש כיפה רשאי לעשות כן",
                        li4: "אין הגבלה לגודל ולצבע הכיפה"
                    }
                ],
            },
            "גיור": {
                "תהליך גיור": [
                    {
                        cardType: "picAndText",
                        pic:"../assets/images/learning/מסכים/assets/TohenPic/GiurTohen.png" ,
                        content: "תחילת תהליך הגיור מתבצע דרך מש\"קית החינוך\n\n"
                    },
                    {
                        cardType: "text",
                        content: "חיילים הנמצאים בתהליך גיור יכולים להמשיך אותו בשיתוף רבנות קריית ההדרכה\n\nבכדי לקדם את תהליך הגיור יש להשתתף בכיתת גיור המתקיימת אחת לחודש ושיעור שבועיים\n\nניתן לתאם זאת דרך רכז המו\"ר ובתיאום עם המפקדים\n\n  "
                    }
                ],
            },
            "השירות המשותף": {
                "לבוש": [
                    {
                        cardType: "picAndText",
                        pic:"../assets/images/learning/מסכים/assets/TohenPic/ShirutMeshutafTohen.png" ,
                        content: "בקריית ההדרכה יש לנוע בלבוש הולם בשטח המגורים, מד\"ס, טיול וכדומה"
                    }
                ],
                "פגיעה בזולת": [
                    {
                        cardType: "text",
                        content: "חל איסור מוחלט על פגיעה בכבוד וברגשות על רקע אמונה דתית<br> האיסור חל על כל דרך העשויה לפגוע בכבוד ו/או ברגשות החייל לרבות פרסום, השמעה, אמירה, הצגה, סיסמאות, שלטים, ציורים, שירים, הרצאה, אמצעי הדרכה או הסברה"
                    }
                ],
                "מד\"סים": [
                    {
                        cardType: "listDots3",
                        numList: "2",
                        li1: "חייל/ת יכול לבקש הדגמה מבן/בת מינו/מינה אם הדבר נוגד את מצפונו/ה הדתי",
                        li2: "חייל/ת המעוניינים בהדרכה ע\"י בן מינם ואין באפשרות המפקדים להיעתר לכך יודרכו ע\"י מפקדם הישיר",
                    },
                    {
                        cardType: "text",
                        content: "בחדר הכושר ובבריכה מתקיימות שעות מגדריות<br> יום שני:  <br>  08:00-10:00 נשים <br>              20:00-22:00 גברים <br>יום רביעי: <br>  08:00-10:00 גברים <br>                 20:00-22:00 נשים",
                    }
                ],
                "הדרכה": [
                    {
                        cardType: "picAndText",
                        pic:"../assets/images/learning/מסכים/assets/Hadrahaa.png" ,
                        content: "חייל דתי זכאי לקורס מגדרי על פי בקשתו"
                    }
                ],
                "פעילות פנאי": [
                    {
                        cardType: "text",
                        content: "חייל או חיילת אשר השתתפותם בפעילות פנאי משותפת נוגדת את אמונתם ואורח חייהם ישוחררו תוך תכנון פעילות אלטרנטיבית מתאימה<br> החיילים לא יבצעו שמירה או כל תורנות אחרת כתחליף לאי - השתתפותם בפעילות פנאי"
                    }
                ],
            },
            "זקן ותספורת": {
                "פטור זקן": [
                    {
                        cardType: "listDots3",
                        numList: "6",
                        li1: `חייל שבידו פטור זמני מהבקו\"ם לא יתגלח עד לקבלת תשובה `,
                        li2: "במידה והבקשה לא אושרה ניתן להגיש ערעור למפקדו של המפקד שדן בבקשה",
                        li3: `חייל בעל היתר זמני אשר החליט להגיש ערעור על בקשה שלא אושרה לא יצטרך להתגלח עד קבלת תשובה בנוגע לערעור `,
                        li4: "ניתן להתגלח באמצעות מכונת גילוח כשרה",
                        li5: "אין להנחות חייל להתגלח דווקא בסכין",
                        li6: "אישור זקן מטעמי דת הינו לשנה בלבד מרגע הוצאתו",
                    },
                ],
                "מנהגי אבלות בזמנים מיוחדים": [
                    {
                        cardType: "text",
                        content: "חייל דתי ללא אישור זקן מטעמי דת בשגרה ונוהג שלא להסתפר ולהתגלח בימי אבל אישי (פטירה של אחד מהקרובים), חול המועד, ספירת העומר ובימי בין המצרים רשאי לשמור על נוהג זה. החייל יפנה למפקדו הישיר על מנת לתאם אישור זקן מטעמי אבלות דרך רסר היחידה"
                    }
                ],
            },
            "סגל רבנות": {
                "חברי הסגל": [
                    {
                        cardType: "_3titles_3text",
                        subTitle1: "רב",
                        content1: "רס\"ן יעקב דדון, רב קריית ההדרכה – 0529465310",
                        subTitle2: "אחראי כשרות ודת",
                        content2: "רנ\"ג יונתן סאלם, אחראי כשרות ודת ביחידה – 0529436610",
                        subTitle3: "נגד כשרות",
                        content3: "רס\"ל עדיאל משה, נגד כשרות ",
                    }
                ],
                "רכזי מו\"ר": [
                    {
                        cardType: "listDots3",
                        numList: "4",
                        li1: "עמית מזרחי, רל\"ש רב קריית ההדרכה :<br> 0503630390",
                        li2: "נתנאל גטו :<br> 0546212769",
                        li3: "אביאל מיכאלי :<br> 0526106473",
                        li4: "ידידיה פניאל :<br> 0584369222",
                        li4: "חיים יוסף בראנץ :<br> 0532859761",
                        li4: "יוסף כהן :<br> 0542241442",
                    }
                ],
            },
        },
    },
};



/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.textTwoParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
    }
}

CARD_TYPES.textThreeParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
        card.querySelector(".text3").innerHTML = json.text3;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.twoPics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".content2").innerHTML = json.content2;
    }
}
CARD_TYPES.video = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
    }
}
CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.pic_4titles_4text = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
        card.querySelector(".sub-title4").innerHTML = json.subTitle4;
        card.querySelector(".content4").innerHTML = json.content4;
    }
}
CARD_TYPES._3titles_3text = {
    init(card, json) {
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
    }
}
CARD_TYPES.listDots3 = {
    init(card, json) {
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${eval("json.li"+num)}</li>`;
        }
    }
}
CARD_TYPES.listNumbers3 = {
    init(card, json) {
        card.querySelector(".sub-title").innerHTML = json.subTitle;
        card.querySelector(".li1").innerHTML = json.li1;
        card.querySelector(".li2").innerHTML = json.li2;
        card.querySelector(".li3").innerHTML = json.li3;
    }
}
